; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-4nodes-1000size-5degree-100mindistance-5trucks-4packages-1172seed

(define (problem transport-two-cities-sequential-4nodes-1000size-5degree-100mindistance-5trucks-4packages-1172seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  truck-5 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 638,507 -> 560,769
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 28)
  ; 560,769 -> 638,507
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 28)
  ; 947,545 -> 560,769
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 45)
  ; 560,769 -> 947,545
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 45)
  ; 947,545 -> 638,507
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 32)
  ; 638,507 -> 947,545
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 32)
  ; 285,213 -> 560,769
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 62)
  ; 560,769 -> 285,213
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 62)
  ; 285,213 -> 638,507
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 46)
  ; 638,507 -> 285,213
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 46)
  ; 285,213 -> 947,545
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 75)
  ; 947,545 -> 285,213
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 75)
  ; 2489,507 -> 2719,846
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 41)
  ; 2719,846 -> 2489,507
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 41)
  ; 2489,507 -> 2082,240
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 49)
  ; 2082,240 -> 2489,507
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 49)
  ; 2410,955 -> 2719,846
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 33)
  ; 2719,846 -> 2410,955
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 33)
  ; 2410,955 -> 2489,507
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 46)
  ; 2489,507 -> 2410,955
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 46)
  ; 947,545 <-> 2082,240
  (road city-1-loc-3 city-2-loc-2)
  (= (road-length city-1-loc-3 city-2-loc-2) 118)
  (road city-2-loc-2 city-1-loc-3)
  (= (road-length city-2-loc-2 city-1-loc-3) 118)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-2)
  (at package-3 city-1-loc-1)
  (at package-4 city-1-loc-4)
  (at truck-1 city-2-loc-3)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-2)
  (at truck-3 city-2-loc-1)
  (capacity truck-3 capacity-3)
  (at truck-4 city-2-loc-4)
  (capacity truck-4 capacity-4)
  (at truck-5 city-2-loc-4)
  (capacity truck-5 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-3)
  (at package-2 city-2-loc-4)
  (at package-3 city-2-loc-3)
  (at package-4 city-2-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-4 city-2-loc-4 city-2-loc-3)
   deleted: (at truck-4 city-2-loc-4)
   added: (at truck-4 city-2-loc-3)
   goals met: 0 of 4
2. (drive truck-4 city-2-loc-3 city-2-loc-2)
   deleted: (at truck-4 city-2-loc-3)
   added: (at truck-4 city-2-loc-2)
   goals met: 0 of 4
3. (drive truck-4 city-2-loc-2 city-1-loc-3)
   deleted: (at truck-4 city-2-loc-2)
   added: (at truck-4 city-1-loc-3)
   goals met: 0 of 4
4. (drive truck-4 city-1-loc-3 city-1-loc-4)
   deleted: (at truck-4 city-1-loc-3)
   added: (at truck-4 city-1-loc-4)
   goals met: 0 of 4
5. (pick-up truck-4 city-1-loc-4 package-4 capacity-3 capacity-4)
   deleted: (at package-4 city-1-loc-4) (capacity truck-4 capacity-4)
   added: (in package-4 truck-4) (capacity truck-4 capacity-3)
   goals met: 0 of 4
6. (drive truck-4 city-1-loc-4 city-1-loc-2)
   deleted: (at truck-4 city-1-loc-4)
   added: (at truck-4 city-1-loc-2)
   goals met: 0 of 4
7. (pick-up truck-4 city-1-loc-2 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-1-loc-2) (capacity truck-4 capacity-3)
   added: (in package-2 truck-4) (capacity truck-4 capacity-2)
   goals met: 0 of 4
8. (drive truck-4 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-4 city-1-loc-2)
   added: (at truck-4 city-1-loc-1)
   goals met: 0 of 4
9. (pick-up truck-4 city-1-loc-1 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-1-loc-1) (capacity truck-4 capacity-2)
   added: (in package-3 truck-4) (capacity truck-4 capacity-1)
   goals met: 0 of 4
10. (pick-up truck-4 city-1-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-1) (capacity truck-4 capacity-1)
   added: (in package-1 truck-4) (capacity truck-4 capacity-0)
   goals met: 0 of 4
11. (drive truck-4 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-4 city-1-loc-1)
   added: (at truck-4 city-1-loc-3)
   goals met: 0 of 4
12. (drive truck-4 city-1-loc-3 city-2-loc-2)
   deleted: (at truck-4 city-1-loc-3)
   added: (at truck-4 city-2-loc-2)
   goals met: 0 of 4
13. (drive truck-4 city-2-loc-2 city-2-loc-3)
   deleted: (at truck-4 city-2-loc-2)
   added: (at truck-4 city-2-loc-3)
   goals met: 0 of 4
14. (drop truck-4 city-2-loc-3 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-4) (capacity truck-4 capacity-0)
   added: (at package-3 city-2-loc-3) (capacity truck-4 capacity-1)
   goals met: 1 of 4
15. (drop truck-4 city-2-loc-3 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-4) (capacity truck-4 capacity-1)
   added: (at package-1 city-2-loc-3) (capacity truck-4 capacity-2)
   goals met: 2 of 4
16. (drive truck-4 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-4 city-2-loc-3)
   added: (at truck-4 city-2-loc-1)
   goals met: 2 of 4
17. (drop truck-4 city-2-loc-1 package-4 capacity-2 capacity-3)
   deleted: (in package-4 truck-4) (capacity truck-4 capacity-2)
   added: (at package-4 city-2-loc-1) (capacity truck-4 capacity-3)
   goals met: 3 of 4
18. (drive truck-4 city-2-loc-1 city-2-loc-4)
   deleted: (at truck-4 city-2-loc-1)
   added: (at truck-4 city-2-loc-4)
   goals met: 3 of 4
19. (drop truck-4 city-2-loc-4 package-2 capacity-3 capacity-4)
   deleted: (in package-2 truck-4) (capacity truck-4 capacity-3)
   added: (at package-2 city-2-loc-4) (capacity truck-4 capacity-4)
   goals met: 4 of 4
